# Pandas教学

In [1]:
import pandas as pd

## 处理缺失值

**Pandas用NaN表示缺失数据，用`isnull`和`notnull`检查缺失数据**

## Series类

### 创建Series对象

In [2]:
obj = pd.Series([1,2,3,4])

In [3]:
obj

0    1
1    2
2    3
3    4
dtype: int64

**例：创建索引序列，用标签标识每个数据点**

In [4]:
obj = pd.Series([3,4,5,12], index = ['a', 'b', 'c', 'd'])

In [5]:
obj

a     3
b     4
c     5
d    12
dtype: int64

In [6]:
obj['a']

3

**例：通过字典生成Series**

In [7]:
sdata = {'a':1, 'b':2, 'c':3}

In [8]:
obj = pd.Series(sdata)

In [9]:
obj

a    1
b    2
c    3
dtype: int64

**可以将字典索引顺序按自己意愿排序**

In [10]:
states = ['c','b','a','d']

In [11]:
obj = pd.Series(sdata, index = states)

In [12]:
obj

c    3.0
b    2.0
a    1.0
d    NaN
dtype: float64

**对数组进行操作时，操作将保留索引连接**

In [13]:
obj[obj > 4]

Series([], dtype: float64)

In [14]:
import numpy as np
np.exp(obj)

c    20.085537
b     7.389056
a     2.718282
d          NaN
dtype: float64

### 自动对齐索引

In [15]:
obj = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [16]:
obj

a    1
b    2
c    3
d    4
dtype: int64

In [17]:
obj1 = pd.Series([7,8,9,0], index = ['a','b','c','f'])

In [18]:
obj1

a    7
b    8
c    9
f    0
dtype: int64

In [19]:
obj + obj1

a     8.0
b    10.0
c    12.0
d     NaN
f     NaN
dtype: float64

### 对象属性(values, index, name)

In [20]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [21]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
obj.name = 'demo1'
obj.index.name = 'index1'

In [23]:
obj

index1
a    1
b    2
c    3
d    4
Name: demo1, dtype: int64

## DataFrame类

### 构建DataFrame

**例1：通过矩阵构建**

In [24]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'b', 'c', 'd'], columns = ['one', 'two', 'three', 'four'])

In [25]:
frame

   one  two  three  four
a    0    1      2     3
b    4    5      6     7
c    8    9     10    11
d   12   13     14    15

**例2：通过字典构建**  
<font color = red>索引值需单独设置</font>

In [26]:
data = {'state':['Ohio','Ohio','Ohio','Nevade','Nevade','Nevade'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

In [27]:
import numpy as np
frame = pd.DataFrame(data, index = np.arange(1,7))

In [28]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevade  2001  2.4
5  Nevade  2002  2.9
6  Nevade  2003  3.2

**例3：通过嵌套字典构建**  
<font color = red>便于设置索引值</font>

In [29]:
pop = {'Nevada':{2001:2.4, 2002:2.9},'Ohio':{2000:1.5, 2001:1.7, 2002:3.6}}

In [30]:
frame1 = pd.DataFrame(pop)

In [31]:
frame1

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

**如果创建时还自己设置了索引值，按自己设置的来**

In [32]:
frame2 = pd.DataFrame(pop, index = [2001,2002,2003])

In [33]:
frame2

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

**如果DataFrame的index和columns分别有name属性，将会显示**

In [34]:
frame2.index.name = 'year'
frame2.columns.name = 'state'

In [35]:
frame2

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2003      NaN   NaN

In [36]:
frame2.Ohio

year
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

**转置DataFrame**

In [37]:
frame1.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

**对于大型DataFrame，通过`head`方法选择头5行**

In [38]:
frame.head()

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevade  2001  2.4
5  Nevade  2002  2.9

**自己设定索引内容及顺序**

In [39]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'], index = [1,2,3,4,5,6])

   year   state  pop
1  2000    Ohio  1.5
2  2001    Ohio  1.7
3  2002    Ohio  3.6
4  2001  Nevade  2.4
5  2002  Nevade  2.9
6  2003  Nevade  3.2

### 索引DataFrame中的一列，类型为Series

In [40]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevade  2001  2.4
5  Nevade  2002  2.9
6  Nevade  2003  3.2

**`Frame.column`只在列名是有效的python变量时有效**

In [41]:
frame.state

1      Ohio
2      Ohio
3      Ohio
4    Nevade
5    Nevade
6    Nevade
Name: state, dtype: object

**`Frame[column]`对任意列名有效**

In [42]:
frame['state']

1      Ohio
2      Ohio
3      Ohio
4    Nevade
5    Nevade
6    Nevade
Name: state, dtype: object

### 索引DataFrame中的一行，类型为Series

In [43]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevade  2001  2.4
5  Nevade  2002  2.9
6  Nevade  2003  3.2

In [44]:
frame.loc[2]

state    Ohio
year     2001
pop       1.7
Name: 2, dtype: object

### 增加新列
<font color = red>增加时列索引则不能使用frame.column

In [45]:
frame

    state  year  pop
1    Ohio  2000  1.5
2    Ohio  2001  1.7
3    Ohio  2002  3.6
4  Nevade  2001  2.4
5  Nevade  2002  2.9
6  Nevade  2003  3.2

**可以直接赋值或数组**

In [46]:
frame['debt'] = 16.5

In [47]:
frame

    state  year  pop  debt
1    Ohio  2000  1.5  16.5
2    Ohio  2001  1.7  16.5
3    Ohio  2002  3.6  16.5
4  Nevade  2001  2.4  16.5
5  Nevade  2002  2.9  16.5
6  Nevade  2003  3.2  16.5

In [48]:
frame['debt'] = np.arange(6) # Python自带的range(6)也可以，推荐用np类型数组

In [49]:
frame

    state  year  pop  debt
1    Ohio  2000  1.5     0
2    Ohio  2001  1.7     1
3    Ohio  2002  3.6     2
4  Nevade  2001  2.4     3
5  Nevade  2002  2.9     4
6  Nevade  2003  3.2     5

**可以赋Series对象**  
<font color = red>Series对象的索引会按照DataFrame的索引排序，空缺的地方为NaN  </font>
<font color = red>Series对象中包含、但DataFrame中没有的索引记录会被舍弃</font>

In [50]:
val = pd.Series([-1.2,-1.5,-1.7,-2], index = [1,3,4,6])

In [51]:
val

1   -1.2
3   -1.5
4   -1.7
6   -2.0
dtype: float64

In [52]:
data = {'state':['Ohio','Ohio','Ohio','Nevade','Nevade','Nevade'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [53]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevade  2001  2.4
4  Nevade  2002  2.9
5  Nevade  2003  3.2

In [54]:
frame['debt'] = val

In [55]:
frame

    state  year  pop  debt
0    Ohio  2000  1.5   NaN
1    Ohio  2001  1.7  -1.2
2    Ohio  2002  3.6   NaN
3  Nevade  2001  2.4  -1.5
4  Nevade  2002  2.9  -1.7
5  Nevade  2003  3.2   NaN

**可以通过判断语句增加布尔列**

In [56]:
frame['eastern'] = frame.state == 'Ohio'

In [57]:
frame

    state  year  pop  debt  eastern
0    Ohio  2000  1.5   NaN     True
1    Ohio  2001  1.7  -1.2     True
2    Ohio  2002  3.6   NaN     True
3  Nevade  2001  2.4  -1.5    False
4  Nevade  2002  2.9  -1.7    False
5  Nevade  2003  3.2   NaN    False

### 修改某处的值
<font color = red>会出现Warning</font>

In [58]:
frame['state'][0] = 'OHIO'

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [59]:
frame

    state  year  pop  debt  eastern
0    OHIO  2000  1.5   NaN     True
1    Ohio  2001  1.7  -1.2     True
2    Ohio  2002  3.6   NaN     True
3  Nevade  2001  2.4  -1.5    False
4  Nevade  2002  2.9  -1.7    False
5  Nevade  2003  3.2   NaN    False

### 删除列

In [60]:
frame

    state  year  pop  debt  eastern
0    OHIO  2000  1.5   NaN     True
1    Ohio  2001  1.7  -1.2     True
2    Ohio  2002  3.6   NaN     True
3  Nevade  2001  2.4  -1.5    False
4  Nevade  2002  2.9  -1.7    False
5  Nevade  2003  3.2   NaN    False

In [61]:
del frame['eastern']

In [62]:
frame.columns

Index(['state', 'year', 'pop', 'debt'], dtype='object')

## 索引对象index

In [63]:
frame

    state  year  pop  debt
0    OHIO  2000  1.5   NaN
1    Ohio  2001  1.7  -1.2
2    Ohio  2002  3.6   NaN
3  Nevade  2001  2.4  -1.5
4  Nevade  2002  2.9  -1.7
5  Nevade  2003  3.2   NaN

In [64]:
frame1

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [65]:
index = frame.index

In [66]:
index

RangeIndex(start=0, stop=6, step=1)

**索引对象INDEX是不可变的，无法修改**

In [67]:
index[1] = 2

TypeError: Index does not support mutable operations

## Pandas基本功能

### 重建索引 reindex

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [ ]:
obj

**新建索引值不存在时，引入缺失值NaN**

In [ ]:
obj1 = obj.reindex(['a','b','c','d','e'])

In [ ]:
obj1

**索引不存在时，使用`method = 'ffill'/'bfill'`插值**  
<font color = red>ffill方法将前值向下填充，bfill是向上填充</font>

In [ ]:
obj = pd.Series(['blue','yellow','red'], index = [2,4,6])

In [ ]:
obj

In [ ]:
obj1 = obj.reindex(range(1,7), method = 'ffill')

In [ ]:
obj1

**DataFrame中也重建行索引**

In [ ]:
frame

In [ ]:
frame1 = frame.reindex([1,2,3,4,5,6,7])

In [ ]:
frame1

**DataFrame可以通过`columns = `重建列索引**

In [ ]:
c = ['year', 'state', 'pop', 'eastern']

In [ ]:
frame2 = frame1.reindex(columns = c)

In [ ]:
frame2

<font color = red>**可以使用`loc`更简洁的索引标签（推荐！！！）**</font>

In [ ]:
frame3 = frame2.loc[np.arange(6),['year', 'state', 'pop', 'eastern']]

In [ ]:
frame3

### 轴向上删除条目 drop

In [ ]:
obj

In [ ]:
new_obj = obj.drop([2, 4])

In [ ]:
new_obj

In [ ]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'b', 'c', 'd'], columns = ['one', 'two', 'three', 'four'])

In [ ]:
frame

In [ ]:
frame.drop(['a','b']) # 默认 axis = 0

In [ ]:
frame.drop('one', axis = 'columns') # 或 axis = 1

**drop不会修改原Series或DataFrame的尺寸和形状，如需修改，可用`inplace = True`**

In [ ]:
frame

In [ ]:
frame.drop('one', axis = 1, inplace = True)

In [ ]:
frame

### 索引选择和过滤

In [ ]:
obj = pd.Series(np.arange(5), index = ['a','b','c','d','e'])

In [ ]:
obj

In [ ]:
obj[2:4]

**字符切片索引包含尾部**

In [ ]:
obj['a':'c']

**通过索引修改Series对象值**

In [ ]:
obj['a':'c']  = 0

In [ ]:
obj

In [ ]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'b', 'c', 'd'], columns = ['one', 'two', 'three', 'four'])
frame

**索引列**

In [ ]:
frame['one']

**索引行**

In [ ]:
frame[:2]

In [ ]:
frame[1:3]

In [ ]:
frame['a':'c']

In [ ]:
frame[frame['one'] > 6]

**通过索引修改DataFrame对象值**

In [ ]:
frame[frame <5] = 0

In [ ]:
frame

<font color = red>**使用loc和iloc选择数据（推荐使用！！！）**</font>

In [ ]:
frame

**loc（轴标签）索引**

In [ ]:
frame.loc['b', ['four','three']]

**等价于iloc（整数标签）索引**

In [ ]:
frame.iloc[1,[3,2]]

**索引列**

In [ ]:
frame.loc[:,'two']

**切片索引**

In [ ]:
frame.loc[ : 'b',['one', 'three']]

<font color = blue>**注意，在pandas对象上使用整数索引容易产生歧义，最好使用loc和iloc**</font>  
例如， `obj[-1]`可以表示标签为1的行，也可以表示倒数第一行，处理中先按标签索引，NaN时回退至位置索引

### 算术和数据对齐

In [ ]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape(4,5), columns = list('abcde'))
df2.loc[1,'b'] = np.nan

In [ ]:
df1

In [ ]:
df2

**`df1 + df2`相当于数据库的外连接，不重叠处值为NaN**

In [ ]:
df1 + df2

**使用`add`方法，将不重叠处确实改值的表中的该处值填充为设定值**

In [ ]:
df1.add(df2, fill_value = 0)

**除了`add`方法，还有其他灵活算术方法**  
r-方法是对应方法的翻转：`df1.rdiv(df2)` 等价于 `df2.div(df1)`

方法|描述
-:|:-
add,radd|加
sub,rsub|减
div,rdiv|除
floordiv,rfloordiv|整除
mul,rmul|乘
pow,rpow|幂次方

### DataFrame和Series间的操作(广播操作)

**行广播**

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('abcd'))

In [ ]:
frame

In [ ]:
series = frame.iloc[0]

In [ ]:
series

In [ ]:
frame - series # 等价于算术方法  frame.sub(series, axis = 1)

**列广播**<font color = red>不能直接使用`frame - series1`，必须用算术方法</font>

In [ ]:
series1 = frame['a']

In [ ]:
series1

In [ ]:
frame -series1

In [ ]:
frame

In [ ]:
frame.sub(series1, axis = 0)

### 函数应用和映射

**Numpy的通用方法都适用于Pandas对象**

In [ ]:
frame

In [ ]:
np.exp(frame)

**利用`apply`方法将函数应用到每行或每列**

In [ ]:
f = lambda x : x.max() - x.min()

<font color = blue>默认应用每列 ，即`axis = index`</font>

In [ ]:
frame.apply(f)

<font color = blue> 使用`axis = columns`作用到每行</font>

In [ ]:
frame.apply(f, axis = "columns")

<font color = blue>可以返回多个Series对象</font>

In [ ]:
def f(x):
    return pd.Series([x.max(), x.min()], index = ['max', 'min'])

In [ ]:
frame.apply(f)

**利用`applymap`方法逐元素操作DataFrame对象**

In [ ]:
format = lambda x : '%.2f' % x

In [ ]:
frame.applymap(format)

### 排序

**使用`sort_index`方法按索引排序**

In [ ]:
obj = pd.Series([1,3,4,2], index = [2,1,3,4])

In [ ]:
obj

In [ ]:
obj.sort_index()

In [ ]:
frame = pd.DataFrame(np.arange(12).reshape(3,4), index = [3,1,2], columns = list('acdb'))

In [ ]:
frame

In [ ]:
frame.sort_index() # 默认按index排序

In [ ]:
frame.sort_index(axis = 1) # 按columns排序

**使用`sort_values`方法按值排序**  
<font color = red>NaN都会被排序至底部</font>

In [ ]:
obj

In [ ]:
obj.sort_values()

**使用`by`参数使用一列或多列作为排序键**

In [ ]:
frame

**默认按升序排列，使用`ascending = False`降序排列**

In [ ]:
frame.sort_values(by = ['d', 'b'] , ascending = False)

### 排名（获取各元素排序后的索引）

**打破平级的方法（解决相同大小值索引不同的问题）**

方法|描述
:-:|:-:
average|默认方法，在每个组中分配平均排名
min|对整个组使用最小排名
max|对整个组使用最大排名
first|按值在数据中出现的次序排名
dense|类似于min，但组间排名总是增加1，而不是一个组中的相等元素的数量

In [ ]:
obj = pd.Series([4,2,4,8])

In [ ]:
obj

In [ ]:
obj.rank()

In [ ]:
obj.rank(method = 'first')

In [ ]:
obj.rank(method = 'max')

### 含有重复标签的轴索引

In [ ]:
obj = pd.Series(range(5),index = list('aaabb'))

In [ ]:
obj

**使用`is_unique`可以得知索引标签是否唯一**

In [ ]:
obj.index.is_unique

**重复索引返回一个序列**

In [ ]:
obj['a']

## 描述性统计的概述与计算

In [69]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]], index = ['a','b','c','d'], columns = ['one','two'])

In [70]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### 统计函数

**描述性统计**  

**默认作用于列，默认自动排除NaN值**

In [71]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [72]:
df.sum(axis = 1, skipna = False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

**汇总统计**

In [73]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### 相关性 corr与协方差 cov

In [75]:
frame = pd.DataFrame(np.arange(12).reshape(3,4), columns = list('abcd'))

In [76]:
frame

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [78]:
frame.cov()

      a     b     c     d
a  16.0  16.0  16.0  16.0
b  16.0  16.0  16.0  16.0
c  16.0  16.0  16.0  16.0
d  16.0  16.0  16.0  16.0

In [79]:
frame.corr()

     a    b    c    d
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0
c  1.0  1.0  1.0  1.0
d  1.0  1.0  1.0  1.0

In [80]:
frame.corrwith(frame.a)

a    1.0
b    1.0
c    1.0
d    1.0
dtype: float64

### 唯一值、计数和成员属性

In [81]:
obj = pd.Series(list('cadaabbcc'))

In [82]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

**统计唯一值`unique()`**

In [83]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

**计数每个值出现次数`value_counts()`**  

**默认按计数值降序排序**

**<font color = red>value_counts也是pandas的顶层方法，可以写做`pd.vlaue_counts(obj)`</font>**

In [85]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

**判断记录是否在给定数组当中`isin`**

In [89]:
mask = obj.isin(['b', 'c'])

In [90]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [91]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

## 数据载入、存储及文件格式

In [3]:
a = list(range(5))